app/views/lists/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."list_id" = 4
---
	<ul>
		<% @list.items.each do |item| %>