app/controllers/lists_controller.rb

INSERT INTO "lists" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 02 Jan 2012 18:48:08 UTC +00:00], ["name", "Shopping List"], ["updated_at", Mon, 02 Jan 2012 18:48:08 UTC +00:00]]
---
  def create
    @list = List.new(params[:list])

    respond_to do |format|
      if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", "3"]]
---
  def update
    @list = List.find(params[:id])